app/Controllers/Clientes.php

    public function index($activo = 1)
    {
        $clientes = $this->clientes->where('activo', $activo)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1

    public function eliminados($activo = 0)
    {
        $clientes = $this->clientes->where('activo', $activo)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 0

    public function editar($id, $valid=null)
    {
        $cliente = $this->clientes->where('id', $id)->first();
---
SELECT *
FROM `clientes`
WHERE `id` = '1'
 LIMIT 1

    public function reingresar($id)
    {
        $this->clientes->update($id, ['activo' => 1]);
---
UPDATE `clientes` SET `activo` = 1, `fecha_edit` = '2024-07-06 16:43:30'
WHERE `clientes`.`id` IN ('2')