app/Controllers/Productos.php

   public function index($activo = 1)
   {

      $productos = $this->productos->where('activo', $activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

   public function nuevo()
   {
      $unidades = $this->unidades->where('activo', 1)->findAll();
      $categorias = $this->categorias->where('activo', 1)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1

   public function insertar()

   {

      if ($this->request->getMethod() == "POST") {
      $this->productos->save([
         'codigo' => $this->request->getPost('codigo'),
         'nombre' => $this->request->getPost('nombre'),
         'precio_venta' => $this->request->getPost('precio_venta'),
         'precio_compra' => $this->request->getPost('precio_compra'),
         'stock_minimo' => $this->request->getPost('stock_minimo'),
         'inventariable' => $this->request->getPost('inventariable'),
         'id_unidad' => $this->request->getPost('id_unidad'),
         'id_categoria' => $this->request->getPost('id_categoria')
      ]);
---
INSERT INTO `productos` (`codigo`, `nombre`, `precio_venta`, `precio_compra`, `stock_minimo`, `inventariable`, `id_unidad`, `id_categoria`, `fecha_alta`, `fecha_edit`) VALUES ('4346', 'dsadf', '65464', '64564', '43453', '1', '3', '1', '2024-06-17 22:18:17', '2024-06-17 22:18:17')

   public function editar($id)
   {
      $unidades = $this->unidades->where('activo', 1)->findAll();
      $categorias = $this->categorias->where('activo', 1)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1