app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo', $activo)->findAll();