app/Controllers/Unidades.php

   public function index($activo = 1)
   {

      $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

   public function eliminados($activo = 0)
   {

      $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 0

   public function editar($id)
   {
      $unidad = $this->unidades->where('id', $id)->first();
---
SELECT *
FROM `unidades`
WHERE `id` = '11'
 LIMIT 1